In [4]:
import pandas as pd

In [5]:
#importando um módulo
from sqlalchemy import create_engine

In [6]:
# Definir as credenciais
import pymysql
import urllib.parse

user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar URL de conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar a conexão com o create_engine()
engine = create_engine(connection_string)

# Escrever consulta SQL
query_alunos = "SELECT * FROM aluno"

# Criar dataframe
df_alunos = pd.read_sql(query_alunos,engine)
# Mostrar 5 primeiros
df_alunos.head()

   id        ra  nome  tempoestudo  rendafamiliar
0   1  00034549  None          NaN            NaN
1   2  00034547  None          NaN            NaN
2   3  00034548  None          NaN            NaN
3   6  00034550  None          NaN            NaN
4   7  00034551  None          NaN            NaN

# Quais bibliotecas um cientista de dados utiliza?

- Pandas
- Numpy
- Fundamentos de IA (Scikit-Learn)

- Material didátocp
- Pandas e Numpy (notebook)
- Scikit-Learn (Apostila do SENAI)

- Pandas: ciência de dados
- Sckit-Learn: Elaboração de modelos de IA
- NumPy: matemática

- 05/08/2024
    - Carregar dados (ok)
    - Salvar um dataframe

In [7]:
# Eu salvei o DataFrame!
csv_file = 'alunos.csv'
df_alunos.to_csv(csv_file,index=False)

In [8]:
# Salve o DataFrame em formato JSON
json_file = 'alunos.json'
df_alunos.to_json(json_file,index=False)

In [9]:
# Salve o DataFrame em formato xlsx
xlsx_file = 'alunos.xlsx'
df_alunos.to_excel(xlsx_file,index=False)

# Um novo DataFrame

In [10]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [18]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda

     tempoestudo  rendafamiliar
0            NaN            NaN
1            NaN            NaN
2            NaN            NaN
3            NaN            NaN
4            NaN            NaN
..           ...            ...
111         30.0         6500.0
112         25.0         6600.0
113         22.0         6700.0
114         28.0         6800.0
115         24.0         6900.0

[116 rows x 2 columns]